#pragma once
 
#include <stdio.h>
#include <stdlib.h>
#include <time.h>
#include <math.h>
#include <ctime>
#include <memory.h>

const int PMax = 1;//константа яка визначає максимальний розмір масива у глибину
const int MMax = 1;//константа яка визначає максимальний розмір масива у ширину
const int NMax = 100000;//константа яка визначає максимальний розмір масива у довжину
const int Time = 10;//константа яка визначає кількість повторень для виміру середнього часу 

extern int Cube[PMax][MMax][NMax]; // тривимірний масив який будем сортувати


void EnterData(const int& P, const int& M, const int& N, const int& mode); //безтипова функція яка заповнює тривимірний масив 
																		   //згідно вибраного режиму
																		   //приймає розмір масива 
																		   //та режим заповнення

void OutputData(const int& P, const int& M, const int& N);//безтипова функція для виводу тривимірного масива по перерізам


void Menu();//безтипова функція яка надає можливість вибору розмірності тривимірного масиву та роботи певного алгоритму обходу та виводить час роботи певного алгоритму обходу
