#pragma once
#include "Header.h"
/*	*	функція для вимірювання середнього часу роботи
	*	алгоритму обходу номер 1
	*	на вхід приймає розмірність масиву (глубина, висота , ширина)
	*	та режим в якому буде заповнений масив до роботи алгоритму 
	*/
clock_t MeasureModeOne(const int& P, const int& M, const int& N, const int& mode);

/*	*	функція для вимірювання середнього часу роботи
	*	алгоритму обходу номер 2
	*	на вхід приймає розмірність масиву (глубина, висота , ширина)
	*	та режим в якому буде заповнений масив до роботи алгоритму
	*/
clock_t MeasureModeTwo(const int& P, const int& M, const int& N, const  int& mode);

/*	*	функція для вимірювання середнього часу роботи
	*	алгоритму обходу номер 3
	*	на вхід приймає розмірність масиву (глубина, висота , ширина)
	*	та режим в якому буде заповнений масив до роботи алгоритму
	*/
clock_t MeasureModeThree(const int& P, const int& M, const int& N, const  int& mode);

/*	*	функція для виміру середнього часу роботи
	*	алгоритму сортування для вектора
	*	на вхід приймає розмір вектора
	*	та режим заповнення вектора
*/
clock_t MeasureModeVector(const  int& N, const  int& mode);