#pragma once
#include "Header.h"
clock_t MeasureModeOne(const int& P, const int& M, const int& N, const int& mode);//функція для вимірювання середнього часу роботи 
																				  // алгоритму обходу номер 1
																				  // на вхід приймає розмірність тривимірного масиву 
																				  // та режим в якому буде заповнений масив до роботи алгоритму 


clock_t MeasureModeTwo(const int& P, const int& M, const int& N, const  int& mode);//функція для вимірювання середнього часу роботи 
																				   // алгоритму обходу номер 2
																				   // на вхід приймає розмірність тривимірного масиву  
																				   // та режим в якому буде заповнений масив до роботи алгоритму 


clock_t MeasureModeThree(const int& P, const int& M, const int& N, const  int& mode);//функція для вимірювання середнього часу роботи 
																					 // алгоритму обходу номер 3
																					 // на вхід приймає розмірність тривимірного масиву  
																					 // та режим в якому буде заповнений масив до роботи алгоритму 