#pragma once
#include "Header.h"

void EnterData(const int& P, const int& M, const int& N, const int& mode); //Функція яка заповнює тривимірний масив 
																		   //згідно вибраного режиму
																		   //приймає розмір масива 
																		   //та режим заповнення

void OutputData(const int& P, const int& M, const int& N);//безтипова функція для виводу тривимірного масива по перерізам


void Menu();//безтипова функція яка надає можливість вибору розмірності тривимірного масиву та роботи певного алгоритму обходу та виводить час роботи певного алгоритму обходу